app/controllers/posts_controller.rb

	def update
		@post = Post.find(params[:id])

		if @post.update(params[:post].permit(:title,:body))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "This is val post update"], ["updated_at", "2015-01-09 21:01:19.882525"], ["id", 4]]